Repository: biblibre/omeka-s-module-Search-docs
Catalog: locales/*/LC_MESSAGES/configuration/search-indexes.po
Languages: fr

source: Search indexes
fr: Indexes de recherches

source: Search indexes are repositories where Omeka resources will be stored in a format suitable doing fast search queries. This repository will be updated every time an Omeka resource is created, modified, or deleted, so the search index will always be in sync with the data present in Omeka.
fr: Les indexes de recherche sont des dépôts où seront stockées les ressources Omeka dans un format approprié pour effectuer des requêtes de recherche rapides. Ce dépôt sera mis à jour à chaque fois qu'une ressource Omeka est créée, modifiée, ou supprimée, donc l'index de recherche sera toujours synchronisé avec les données présentes dans Omeka.

source: Create a search index
fr: Créer un index de recherche

source: To create a search index, go to the Search module's main configuration page.
fr: Pour créer un index de recherche, allez sur la page de configuration principale du module Search.

source: Then click on the "Add new index" button in the upper right corner.
fr: Puis cliquez sur le bouton « Ajouter un nouvel index » dans le coin supérieur droit.

source: Give the search index a name, and select a search adapter. If you don't have any available adapters, you need to install additional modules first, for instance `Solr <https://github.com/biblibre/omeka-s-module-Solr>`_.
fr: Donnez un nom à l'index de recherche, et sélectionnez un adaptateur. Si aucun adaptateur n'est disponible, vous devez d'abord installer des modules supplémentaires, par exemple `Solr <https://github.com/biblibre/omeka-s-module-Solr>`_.

source: To continue, click on the "Add" button. This will create the search index, and redirect you to the search index configuration page.
fr: Pour continuer, cliquez sur le bouton « Ajouter ». Cela créera l'index de recherche, et vous redirigera vers la page de configuration de l'index de recherche.

source: Choose if you want to index items, item sets, or both. If you choose to index both, then both types of resources will be displayed in the search results. There could be also settings specific to the adapter you selected in the previous screen.
fr: Choisissez si vous voulez indexer les contenus, les collections, ou les deux. Si vous choisissez d'indexer les deux, alors les deux types de ressources seront affichées dans les résultats de recherche. Il peut aussi y avoir des paramètres spécifiques à l'adaptateur que vous avez sélectionné à l'écran précédent.

source: Once all settings are set, click on the "Save configuration" button. You will be redirected back to the main configuration page.
fr: Une fois les paramètres définis, cliquez sur le bouton « Enregistrer la configuration ». Vous serez redirigé vers la page de configuration principale.

source: Rebuild a search index
fr: Reconstruire un index de recherche

source: When a search index is created, it is empty. If you already have created resources, you have to manually rebuild the index in order to index all existing resources. You will also need to rebuild the index if you change something in the adapter settings and want the changes to apply immediately.
fr: Quand un index de recherche est créé, il est vide. Si vous avez déjà créé des ressources, vous devez reconstruire manuellement l'index pour indexer toutes les ressources existantes. Vous aurez également besoin de reconstruire l'index si vous changez quelque chose dans les paramètres de l'adaptateur et que vous voulez que les changements s'appliquent immédiatement.

source: To rebuild the index, go to the Search module's main configuration page, find the search index you want to rebuild and click on the |sync icon| sync icon on the corresponding row.
fr: Pour reconstruire l'index, allez sur la page de configuration principale du module Search, trouvez l'index de recherche que vous voulez reconstruire et cliquez sur |sync icon| l'icône de synchronisation sur la ligne correspondante.

source: You have the following options:
fr: Vous avez les options suivantes:

source: Clear index
fr: Nettoyer l'index

source: If you want to empty the index completely before rebuilding it, check that box.
fr: Si vous voulez vider l'index complètement avant de le reconstruire, cochez cette case.

source: Batch size
fr: Taille des lots

source: This setting lets you change the number of resources that will be indexed at once. In general, indexing large batchs is faster, but uses more memory. If you're not sure, keep the default value.
fr: Ce paramètre vous permet de modifier le nombre de ressources qui seront indexées en même temps. En général, indexer des grands lots est plus rapide, mais utilise plus de mémoire. Si vous n'êtes pas sûr, gardez la valeur par défaut.

source: To start the rebuilding process, click on the "Start index rebuild" button. The process will be started in a background job and you will be redirected back to the module's main configuration page.
fr: Pour commencer le processus de reconstruction, cliquez sur le bouton « Démarrer la reconstruction de l'index ». Le processus sera lancé dans une tâche de fond et vous serez redirigé vers la page de configuration principale du module.

source: Now that you have a search index, you can create a :doc:`search page <search-pages>`.
fr: Maintenant que vous avez un index de recherche, vous pouvez créer une :doc:`page de recherche <search-pages>`.

source: Delete a search index
fr: Supprimer un index de recherche

source: To delete a search index, go to the Search module's main configuration page, find the search index you want to delete and click on the |trash icon| trash icon on the corresponding row. A drawer will appear on the right of the screen.
fr: Pour supprimer un index de recherche, allez sur la page de configuration principale du module Search, trouvez l'index de recherche que vous voulez supprimer et cliquez sur |trash icon| l'icône de poubelle sur la ligne correspondante. Un tiroir apparaîtra sur la droite de l'écran.

source: Click on the "Confirm delete" button to delete the search index.
fr: Cliquez sur le bouton « Confirmer la suppression » pour supprimer l'index de recherche.

source: This will not delete the actual data owned by the search engine. Only the search index configuration in Omeka will be deleted.
fr: Cela ne supprimera pas les données réelles propres au moteur de recherche. Seule la configuration de l'index de recherche dans Omeka sera supprimée.
